sviete/Tasmota-ESP32/tasmota/tasmota_xdrv_driver/xdrv_01_9_webserver.ino
void HandleSwitchBootPartition(void)
{
  if (!HttpCheckPriviledgedAccess()) { return; }

  char tmp1[8];
  WebGetArg(PSTR("u4"), tmp1, sizeof(tmp1));

  bool switch_factory = false;      // trigger a restart to factory partition?
  bool switch_ota = false;          // switch back to OTA partition
  bool single_ota = EspSingleOtaPartition();
  bool api_mode = Webserver->hasArg("api");   // api-mode, returns `true`, `false` or `none`

  // switch to next OTA?
  if (strcmp("ota", tmp1) == 0) {
    switch_ota = true;
    if (single_ota && !EspRunningFactoryPartition()) {
      switch_ota = false;                     // if in single-OTA and already running OTA, nothing to do
    }
  }
  // switch to factory ?
  if (strcmp("fct", tmp1) == 0 && single_ota && !EspRunningFactoryPartition()) {
    switch_factory = true;
  }

  // apply the change in flash and return result
  if (switch_factory || switch_ota) {
    SettingsSaveAll();
    if (switch_factory) {
      EspPrepRestartToSafeBoot();
    } else {
      const esp_partition_t* partition = esp_ota_get_next_update_partition(nullptr);
      esp_ota_set_boot_partition(partition);
    }

    if (api_mode) {
      WSReturnSimpleString("false");
      AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_HTTP D_RESTART));
      EspRestart();
    } else {
      WebRestart(4);
    }
  } else {
    if (api_mode) {
      // return `none` or `true`
      WSReturnSimpleString(EspSingleOtaPartition() ? "true" : "none");
    } else {
      Webserver->sendHeader("Location", "/", true);
      Webserver->send(302, "text/plain", "");
    }
  }
  Web.upload_file_type = UPL_TASMOTA;
}
#endif // ESP32

/*-------------------------------------------------------------------------------------------*/

void HandleHttpCommand(void)
{
  if (!HttpCheckPriviledgedAccess(false)) { return; }

  AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_HTTP D_COMMAND));

  if (!WebAuthenticate()) {
    // Prefer authorization via HTTP header (Basic auth), if it fails, use legacy method via GET parameters
    char tmp1[33];
    WebGetArg(PSTR("user"), tmp1, sizeof(tmp1));
    char tmp2[strlen(SettingsText(SET_WEBPWD)) + 2];  // Need space for an entered password longer than set password
    WebGetArg(PSTR("password"), tmp2, sizeof(tmp2));

    if (!(!strcmp(tmp1, WEB_USERNAME) && !strcmp(tmp2, SettingsText(SET_WEBPWD)))) {
      WSContentBegin(401, CT_APP_JSON);
      WSContentSend_P(PSTR("{\"" D_RSLT_WARNING "\":\"" D_NEED_USER_AND_PASSWORD "\"}"));
      WSContentEnd();

      // https://github.com/arendst/Tasmota/discussions/15420
      ShowWebSource(SRC_WEBCOMMAND);
      AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_HTTP "Bad userid and/or password"));

      return;
    }
  }

  WSContentBegin(200, CT_APP_JSON);
  String svalue = Webserver->arg(F("cmnd"));
  if (svalue.length() && (svalue.length() < MQTT_MAX_PACKET_SIZE)) {
    uint32_t curridx = TasmotaGlobal.log_buffer_pointer;
    TasmotaGlobal.templog_level = LOG_LEVEL_INFO;
    ExecuteWebCommand((char*)svalue.c_str(), SRC_WEBCOMMAND);
    WSContentSend_P(PSTR("{"));
    bool cflg = false;
    uint32_t index = curridx;
    char* line;
    size_t len;
    while (GetLog(TasmotaGlobal.templog_level, &index, &line, &len)) {
      // [14:49:36.123 MQTT: stat/wemos5/RESULT = {"POWER":"OFF"}] > [{"POWER":"OFF"}]
      char* JSON = (char*)memchr(line, '{', len);
      if (JSON) {  // Is it a JSON message (and not only [15:26:08 MQT: stat/wemos5/POWER = O])
        if (cflg) { WSContentSend_P(PSTR(",")); }
        uint32_t JSONlen = len - (JSON - line) -3;
        for( ++JSON ; JSONlen && JSON[JSONlen] != '}' ; JSONlen-- );
        WSContentSend(JSON, JSONlen);
        cflg = true;
      }
    }
    WSContentSend_P(PSTR("}"));
    TasmotaGlobal.templog_level = 0;
  } else {
    WSContentSend_P(PSTR("{\"" D_RSLT_WARNING "\":\"" D_ENTER_COMMAND " cmnd=\"}"));
  }
  WSContentEnd();
}

/*-------------------------------------------------------------------------------------------*/

void HandleManagement(void)
{
  if (!HttpCheckPriviledgedAccess()) { return; }

  AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_HTTP D_MANAGEMENT));

  WSContentStart_P(PSTR(D_MANAGEMENT));
  WSContentSendStyle();

  WSContentButton(BUTTON_CONSOLE);

  XdrvMailbox.index = 0;
  XdrvXsnsCall(FUNC_WEB_ADD_CONSOLE_BUTTON);

  WSContentSend_P(PSTR("<div></div>"));            // 5px padding
  XdrvCall(FUNC_WEB_ADD_MANAGEMENT_BUTTON);

  WSContentSpaceButton(BUTTON_MAIN);
  WSContentStop();
}

void HandleConsole(void)
{
  if (!HttpCheckPriviledgedAccess()) { return; }

  if (Webserver->hasArg(F("c2"))) {      // Console refresh requested
    HandleConsoleRefresh();
    return;
  }

  AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_HTTP D_CONSOLE));

  WSContentStart_P(PSTR(D_CONSOLE));
  WSContentSend_P(HTTP_SCRIPT_CONSOL, Settings->web_refresh);
#ifdef USE_CONSOLE_CSS_FLEX
  WSContentSendStyle_P(HTTP_CMND_STYLE);
#else
  WSContentSendStyle();
#endif  // USE_CONSOLE_CSS_FLEX
  WSContentSend_P(HTTP_FORM_CMND);
  WSContentSpaceButton((WebUseManagementSubmenu()) ? BUTTON_MANAGEMENT : BUTTON_MAIN);
  WSContentStop();
}

void HandleConsoleRefresh(void)
{
  String svalue = Webserver->arg(F("c1"));
  if (svalue.length() && (svalue.length() < MQTT_MAX_PACKET_SIZE)) {
    AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_COMMAND "%s"), svalue.c_str());
    ExecuteWebCommand((char*)svalue.c_str(), SRC_WEBCONSOLE);
  }

  char stmp[8];
  WebGetArg(PSTR("c2"), stmp, sizeof(stmp));
  uint32_t index = 0;                // Initial start, dump all
  if (strlen(stmp)) { index = atoi(stmp); }

  WSContentBegin(200, CT_PLAIN);
  WSContentSend_P(PSTR("%d}1%d}1"), TasmotaGlobal.log_buffer_pointer, Web.reset_web_log_flag);
  if (!Web.reset_web_log_flag) {
    index = 0;
    Web.reset_web_log_flag = true;
  }
  bool cflg = (index);
  char* line;
  size_t len;
  while (GetLog(Settings->weblog_level, &index, &line, &len)) {
    if (cflg) { WSContentSend_P(PSTR("\n")); }
    WSContentSend(line, len -1);
    cflg = true;
  }
  WSContentSend_P(PSTR("}1"));
  WSContentEnd();
}

