sviete/Tasmota-ESP32/tasmota/tasmota_xdrv_driver/xdrv_01_9_webserver.ino
      int http_code;
      if (0 == strcasecmp_P(method, PSTR("GET"))) { http_code = http.GET(); }
      else if (0 == strcasecmp_P(method, PSTR("POST"))) { http_code = http.POST(body); }
      else if (0 == strcasecmp_P(method, PSTR("PUT"))) { http_code = http.PUT(body); }
      else if (0 == strcasecmp_P(method, PSTR("PATCH"))) { http_code = http.PATCH(body); }
      else return status;

      if (http_code > 0) {                    // http_code will be negative on error
        if (http_code == HTTP_CODE_OK || http_code == HTTP_CODE_MOVED_PERMANENTLY) {
#ifdef USE_WEBSEND_RESPONSE
          // Return received data to the user - Adds 900+ bytes to the code
          const char* read = http.getString().c_str();  // File found at server - may need lot of ram or trigger out of memory!
          ResponseClear();
          Response_P(PSTR("{\"" D_CMND_WEBQUERY "\":"));
          char text[2] = { 0 };
          text[0] = *read++;
          bool assume_json = (text[0] == '{') || (text[0] == '[');
          if (!assume_json) { ResponseAppend_P(PSTR("\"")); }
          while (text[0] != '\0') {
            if (text[0] > 31) {               // Remove control characters like linefeed
              if (assume_json) {
                if (ResponseAppend_P(text) == ResponseSize()) { break; };
              } else {
                if (ResponseAppend_P(EscapeJSONString(text).c_str()) == ResponseSize()) { break; };
              }
            }
            text[0] = *read++;
          }
          if (!assume_json) { ResponseAppend_P(PSTR("\"")); }
          ResponseJsonEnd();
#ifdef USE_SCRIPT
          extern uint8_t tasm_cmd_activ;
          // recursive call must be possible in this case
          tasm_cmd_activ = 0;
#endif  // USE_SCRIPT
          MqttPublishPrefixTopicRulesProcess_P(RESULT_OR_STAT, PSTR(D_CMND_WEBQUERY));
#endif  // USE_WEBSEND_RESPONSE
        }
        status = WEBCMND_DONE;
      } else {
        status = WEBCMND_CONNECT_FAILED;
      }
      http.end();                             // Clean up connection data
    } else {
      status = WEBCMND_HOST_NOT_FOUND;
    }
  }
  return status;
}

#ifdef USE_WEBGETCONFIG
int WebGetConfig(char *buffer) {
  // http://user:password@server:port/path/%id%.dmp  : %id% will be expanded to MAC address

  int status = WEBCMND_WRONG_PARAMETERS;

  RemoveSpace(buffer);                        // host = |[192.168.178.86:80,admin:joker|
  String url = ResolveToken(buffer);

  DEBUG_CORE_LOG(PSTR("WEB: Config Uri '%s'"), url.c_str());


#if defined(ESP32) && defined(USE_WEBCLIENT_HTTPS)
  HTTPClientLight http;
  if (http.begin(UrlEncode(url))) {         // UrlEncode(url) = |http://192.168.178.86/cm?cmnd=POWER1%20ON|
#else // HTTP only
  WiFiClient http_client;
  HTTPClient http;
  if (http.begin(http_client, UrlEncode(url))) {  // UrlEncode(url) = |http://192.168.178.86/cm?cmnd=POWER1%20ON|
#endif
    int http_code = http.GET();             // Start connection and send HTTP header
    if (http_code > 0) {                    // http_code will be negative on error
      status = WEBCMND_DONE;
      if (http_code == HTTP_CODE_OK || http_code == HTTP_CODE_MOVED_PERMANENTLY) {
        WiFiClient *stream = http.getStreamPtr();
        int len = http.getSize();
        if (len <= sizeof(TSettings)) { 
          len = sizeof(TSettings);
        }
        if (SettingsBufferAlloc(len)) {
          uint8_t *buff = settings_buffer;
          while (http.connected() && (len > 0)) {
            size_t size = stream->available();
            if (size) {
              int read = stream->readBytes(buff, len);
              len -= read;
            }
            delayMicroseconds(1);
          }
          if (len) {
            DEBUG_CORE_LOG(PSTR("WEB: Connection lost"));
            status = WEBCMND_CONNECTION_LOST;
          } else if (SettingsConfigRestore()) {
            AddLog(LOG_LEVEL_INFO, PSTR("WEB: Settings applied, restarting"));
            TasmotaGlobal.restart_flag = 2;  // Always restart to re-enable disabled features during update
          } else {
            DEBUG_CORE_LOG(PSTR("WEB: Settings file invalid"));
            status = WEBCMND_INVALID_FILE;
          }
        } else {
          DEBUG_CORE_LOG(PSTR("WEB: Memory error (%d) or invalid file length (%d)"), settings_buffer, len);
          status = WEBCMND_MEMORY_ERROR;
        }
      } else {
        AddLog(LOG_LEVEL_DEBUG, PSTR("WEB: HTTP error %d"), http_code);
        status = (http_code == HTTP_CODE_NOT_FOUND) ? WEBCMND_FILE_NOT_FOUND : WEBCMND_OTHER_HTTP_ERROR;
      }
    } else {
      DEBUG_CORE_LOG(PSTR("WEB: Connection failed"));
      status = 2;                           // Connection failed
    }
    http.end();                             // Clean up connection data
  } else {
    status = 3;                             // Host not found or connection error
  }

  return status;
}
#endif // USE_WEBGETCONFIG

bool JsonWebColor(const char* dataBuf)
{
  // Default (Dark theme)
  // {"WebColor":["#eaeaea","#252525","#4f4f4f","#000","#ddd","#65c115","#1f1f1f","#ff5661","#008000","#faffff","#1fa3ec","#0e70a4","#d43535","#931f1f","#47c266","#5aaf6f","#faffff","#999","#eaeaea"]}
  // Default pre v7 (Light theme)
  // {"WebColor":["#000","#fff","#f2f2f2","#000","#fff","#000","#fff","#f00","#008000","#fff","#1fa3ec","#0e70a4","#d43535","#931f1f","#47c266","#5aaf6f","#fff","#999","#000"]}	  // {"WebColor":["#000000","#ffffff","#f2f2f2","#000000","#ffffff","#000000","#ffffff","#ff0000","#008000","#ffffff","#1fa3ec","#0e70a4","#d43535","#931f1f","#47c266","#5aaf6f","#ffffff","#999999","#000000"]}

  JsonParser parser((char*) dataBuf);
  JsonParserObject root = parser.getRootObject();
  JsonParserArray arr = root[PSTR(D_CMND_WEBCOLOR)].getArray();
  if (arr) {  // if arr is valid, i.e. json is valid, the key D_CMND_WEBCOLOR was found and the token is an arra
    uint32_t i = 0;
    for (auto color : arr) {
      if (i < COL_LAST) {
        WebHexCode(i, color.getStr());
      } else {
        break;
      }
      i++;
    }
  }
  return true;
}

const char kWebCmndStatus[] PROGMEM = D_JSON_DONE "|" D_JSON_WRONG_PARAMETERS "|" D_JSON_CONNECT_FAILED "|" D_JSON_HOST_NOT_FOUND "|" D_JSON_MEMORY_ERROR
#ifdef USE_WEBGETCONFIG
  "|" D_JSON_FILE_NOT_FOUND "|" D_JSON_OTHER_HTTP_ERROR "|" D_JSON_CONNECTION_LOST "|" D_JSON_INVALID_FILE_TYPE
#endif // USE_WEBGETCONFIG
;

const char kWebCommands[] PROGMEM = "|"  // No prefix
  D_CMND_WEBLOG "|"
#ifndef FIRMWARE_MINIMAL_ONLY
  D_CMND_WEBTIME "|"
#ifdef USE_EMULATION
  D_CMND_EMULATION "|"
#endif
#ifdef USE_SENDMAIL
  D_CMND_SENDMAIL "|"
#endif
  D_CMND_WEBSERVER "|" D_CMND_WEBPASSWORD "|" D_CMND_WEBREFRESH "|" D_CMND_WEBSEND "|" D_CMND_WEBQUERY "|"
  D_CMND_WEBCOLOR "|" D_CMND_WEBSENSOR "|" D_CMND_WEBBUTTON
#ifdef USE_WEBGETCONFIG
  "|" D_CMND_WEBGETCONFIG
#endif
#ifdef USE_CORS
  "|" D_CMND_CORS
#endif
#endif  // FIRMWARE_MINIMAL_ONLY
;

void (* const WebCommand[])(void) PROGMEM = {
  &CmndWeblog,
#ifndef FIRMWARE_MINIMAL_ONLY
  &CmndWebTime,
#ifdef USE_EMULATION
  &CmndEmulation,
#endif
#ifdef USE_SENDMAIL
  &CmndSendmail,
#endif
  &CmndWebServer, &CmndWebPassword, &CmndWebRefresh, &CmndWebSend, &CmndWebQuery,
  &CmndWebColor, &CmndWebSensor, &CmndWebButton
#ifdef USE_WEBGETCONFIG
  , &CmndWebGetConfig
#endif
#ifdef USE_CORS
  , &CmndCors
#endif
#endif  // FIRMWARE_MINIMAL_ONLY
  };

/*********************************************************************************************\
 * Commands
\*********************************************************************************************/

void CmndWebTime(void) {
  // 2017-03-07T11:08:02-07:00
  // 0123456789012345678901234
  //
  // WebTime 0,16  = 2017-03-07T11:08 - No seconds
  // WebTime 11,19 = 11:08:02
  uint32_t values[2] = { 0 };
  String datetime = GetDateAndTime(DT_LOCAL);
  if (ParseParameters(2, values) > 1) {
    Settings->web_time_start = values[0];
    Settings->web_time_end = values[1];
    if (Settings->web_time_end > datetime.length()) { Settings->web_time_end = datetime.length(); }
    if (Settings->web_time_start >= Settings->web_time_end) { Settings->web_time_start = 0; }
  }
  Response_P(PSTR("{\"%s\":[%d,%d],\"Time\":\"%s\"}"),
    XdrvMailbox.command, Settings->web_time_start, Settings->web_time_end,
    datetime.substring(Settings->web_time_start, Settings->web_time_end).c_str());
}

#ifdef USE_EMULATION
void CmndEmulation(void)
{
#if defined(USE_EMULATION_WEMO) || defined(USE_EMULATION_HUE)
#if defined(USE_EMULATION_WEMO) && defined(USE_EMULATION_HUE)
  if ((XdrvMailbox.payload >= EMUL_NONE) && (XdrvMailbox.payload < EMUL_MAX)) {
#else
#ifndef USE_EMULATION_WEMO
  if ((EMUL_NONE == XdrvMailbox.payload) || (EMUL_HUE == XdrvMailbox.payload)) {
#endif
#ifndef USE_EMULATION_HUE
  if ((EMUL_NONE == XdrvMailbox.payload) || (EMUL_WEMO == XdrvMailbox.payload)) {
#endif
#endif
    Settings->flag2.emulation = XdrvMailbox.payload;
    TasmotaGlobal.restart_flag = 2;
  }
#endif
  ResponseCmndNumber(Settings->flag2.emulation);
}
#endif  // USE_EMULATION

#ifdef USE_SENDMAIL
void CmndSendmail(void) {
  if (XdrvMailbox.data_len > 0) {
    uint8_t result = SendMail(XdrvMailbox.data);
    char stemp1[20];
    ResponseCmndChar(GetTextIndexed(stemp1, sizeof(stemp1), result, kWebCmndStatus));
  }
}
#endif  // USE_SENDMAIL

