sviete/Tasmota-ESP32/tasmota/tasmota_xdrv_driver/xdrv_01_9_webserver.ino
void CmndWebServer(void)
{
  if ((XdrvMailbox.payload >= 0) && (XdrvMailbox.payload <= 2)) {
    Settings->webserver = XdrvMailbox.payload;
  }
  if (Settings->webserver) {
    Response_P(PSTR("{\"" D_CMND_WEBSERVER "\":\"" D_JSON_ACTIVE_FOR " %s " D_JSON_ON_DEVICE " %s " D_JSON_WITH_IP_ADDRESS " %_I\"}"),
      (2 == Settings->webserver) ? PSTR(D_ADMIN) : PSTR(D_USER), NetworkHostname(), (uint32_t)NetworkAddress());
  } else {
    ResponseCmndStateText(0);
  }
}

void CmndWebPassword(void)
{
  bool show_asterisk = (2 == XdrvMailbox.index);
  if (XdrvMailbox.data_len > 0) {
    SettingsUpdateText(SET_WEBPWD, (SC_CLEAR == Shortcut()) ? "" : (SC_DEFAULT == Shortcut()) ? WEB_PASSWORD : XdrvMailbox.data);
    if (!show_asterisk) {
      ResponseCmndChar(SettingsText(SET_WEBPWD));
    }
  } else {
    show_asterisk = true;
  }
  if (show_asterisk) {
    Response_P(S_JSON_COMMAND_ASTERISK, XdrvMailbox.command);
  }
}

void CmndWeblog(void)
{
  if ((XdrvMailbox.payload >= LOG_LEVEL_NONE) && (XdrvMailbox.payload <= LOG_LEVEL_DEBUG_MORE)) {
    Settings->weblog_level = XdrvMailbox.payload;
  }
  ResponseCmndNumber(Settings->weblog_level);
}

void CmndWebRefresh(void)
{
  if ((XdrvMailbox.payload > 999) && (XdrvMailbox.payload <= 65000)) {
    Settings->web_refresh = XdrvMailbox.payload;
  }
  ResponseCmndNumber(Settings->web_refresh);
}

void CmndWebSend(void)
{
  if (XdrvMailbox.data_len > 0) {
    uint32_t result = WebSend(XdrvMailbox.data);
    char stemp1[20];
    ResponseCmndChar(GetTextIndexed(stemp1, sizeof(stemp1), result, kWebCmndStatus));
  }
}

void CmndWebQuery(void)
{
  if (XdrvMailbox.data_len > 0) {
    uint32_t result = WebQuery(XdrvMailbox.data);
    char stemp1[20];
    ResponseCmndChar(GetTextIndexed(stemp1, sizeof(stemp1), result, kWebCmndStatus));
  }
}

#ifdef USE_WEBGETCONFIG
void CmndWebGetConfig(void) {
  // WebGetConfig http://myserver:8000/tasmota/conf/%id%.dmp where %id% is expanded to device mac address
  // WebGetConfig http://myserver:8000/tasmota/conf/Config_demo_9.5.0.8.dmp
  if (XdrvMailbox.data_len > 0) {
    uint32_t result = WebGetConfig(XdrvMailbox.data);
    char stemp1[20];
    ResponseCmndChar(GetTextIndexed(stemp1, sizeof(stemp1), result, kWebCmndStatus));
  }
}
#endif // USE_WEBGETCONFIG

void CmndWebColor(void)
{
  if (XdrvMailbox.data_len > 0) {
    if (strchr(XdrvMailbox.data, '{') == nullptr) {  // If no JSON it must be parameter
      if ((XdrvMailbox.data_len > 3) && (XdrvMailbox.index > 0) && (XdrvMailbox.index <= COL_LAST)) {
        WebHexCode(XdrvMailbox.index -1, XdrvMailbox.data);
      }
      else if (0 == XdrvMailbox.payload) {
        SettingsDefaultWebColor();
      }
    }
    else {
#ifndef FIRMWARE_MINIMAL      // if tasmota-minimal, read only and don't parse JSON
      JsonWebColor(XdrvMailbox.data);
#endif // FIRMWARE_MINIMAL
    }
  }
  Response_P(PSTR("{\"%s\":["), XdrvMailbox.command);
  for (uint32_t i = 0; i < COL_LAST; i++) {
    ResponseAppend_P(PSTR("%s\"#%06x\""), (i>0)?",":"", WebColor(i));
  }
  ResponseAppend_P(PSTR("]}"));
}

void CmndWebSensor(void)
{
  if (XdrvMailbox.index < MAX_XSNS_DRIVERS) {
    if (XdrvMailbox.payload >= 0) {
      bitWrite(Settings->sensors[1][XdrvMailbox.index / 32], XdrvMailbox.index % 32, XdrvMailbox.payload &1);
    }
  }
  Response_P(PSTR("{\"" D_CMND_WEBSENSOR "\":"));
  XsnsSensorState(1);
  ResponseJsonEnd();
}

void CmndWebButton(void)
{
  if ((XdrvMailbox.index > 0) && (XdrvMailbox.index <= MAX_BUTTON_TEXT)) {
    if (!XdrvMailbox.usridx) {
      ResponseCmndAll(SET_BUTTON1, MAX_BUTTON_TEXT);
    } else {
      if (XdrvMailbox.data_len > 0) {
        SettingsUpdateText(SET_BUTTON1 + XdrvMailbox.index -1, ('"' == XdrvMailbox.data[0]) ? "" : XdrvMailbox.data);
      }
      ResponseCmndIdxChar(SettingsText(SET_BUTTON1 + XdrvMailbox.index -1));
    }
  }
}

#ifdef USE_CORS
void CmndCors(void)
{
  if (XdrvMailbox.data_len > 0) {
    SettingsUpdateText(SET_CORS, (SC_CLEAR == Shortcut()) ? "" : (SC_DEFAULT == Shortcut()) ? CORS_DOMAIN : XdrvMailbox.data);
  }
  ResponseCmndChar(SettingsText(SET_CORS));
}
#endif

/*********************************************************************************************\
 * Interface
\*********************************************************************************************/

bool Xdrv01(uint32_t function)
{
  bool result = false;

  switch (function) {
    case FUNC_LOOP:
      PollDnsWebserver();
#ifdef USE_EMULATION
      if (Settings->flag2.emulation) { PollUdp(); }
#endif  // USE_EMULATION
      break;
    case FUNC_EVERY_SECOND:
      if (Web.initial_config) {
        Wifi.config_counter = 200;    // Do not restart the device if it has SSId Blank
      }
      if (Wifi.wifi_test_counter) {
        Wifi.wifi_test_counter--;
        AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_WIFI D_TRYING_TO_CONNECT " %s"), SettingsText(SET_STASSID1));
        IPAddress local_ip;
        if (WifiGetIP(&local_ip, true)) {            // Got IP - Connection Established (exclude AP address)
          Wifi.wifi_test_AP_TIMEOUT = false;
          Wifi.wifi_test_counter = 0;
          Wifi.wifiTest = WIFI_TEST_FINISHED;
          AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_WIFI D_CMND_SSID " %s: " D_CONNECTED " - " D_IP_ADDRESS " %s"), SettingsText(Wifi.wifi_Test_Save_SSID2 ? SET_STASSID2 : SET_STASSID1), local_ip.toString().c_str());
//          TasmotaGlobal.blinks = 255;                    // Signal wifi connection with blinks
          if (MAX_WIFI_OPTION != Wifi.old_wificonfig) {
            TasmotaGlobal.wifi_state_flag = Settings->sta_config = Wifi.old_wificonfig;
          }
          TasmotaGlobal.save_data_counter = Wifi.save_data_counter;
          Settings->save_data = Wifi.save_data_counter;
          SettingsSaveAll();

          if ( Wifi.wifi_Test_Restart ) { TasmotaGlobal.restart_flag = 2; }

#if (!RESTART_AFTER_INITIAL_WIFI_CONFIG)
          Web.initial_config = false;
          Web.state = HTTP_ADMIN;
#endif
        } else if (!Wifi.wifi_test_counter) { // Test TimeOut
          Wifi.wifi_test_counter = 0;
          Wifi.wifiTest = WIFI_TEST_FINISHED_BAD;
          switch (WiFi.status()) {
            case WL_CONNECTED:
              AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_WIFI D_CONNECT_FAILED_NO_IP_ADDRESS));
              Wifi.wifi_test_AP_TIMEOUT = false;
              break;
            case WL_NO_SSID_AVAIL:
              AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_WIFI D_CONNECT_FAILED_AP_NOT_REACHED));
              Wifi.wifi_test_AP_TIMEOUT = false;
              break;
            case WL_CONNECT_FAILED:
              AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_WIFI D_CONNECT_FAILED_WRONG_PASSWORD));
              Wifi.wifi_test_AP_TIMEOUT = false;
              break;
            default:  // WL_IDLE_STATUS and WL_DISCONNECTED - SSId in range but no answer from the router
              AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_WIFI D_CONNECT_FAILED_AP_TIMEOUT));
              // If this error occurs twice, Tasmota will connect directly to the router without testing credentials.
              //   ESP8266 in AP+STA mode can manage only 11b and 11g, so routers that are 11n-ONLY won't respond.
              //   For this case, the user will see in the UI a message to check credentials. After that, if the user hits
              //   save and connect again, and the CONNECT_FAILED_AP_TIMEOUT is shown again, Credentials will be saved and
              //   Tasmota will restart and try to connect in STA mode only (11b/g/n).
              //
              //   If it fails again, depending on the WIFICONFIG settings, the user will need to wait or will need to
              //   push 6 times the button to enable Tasmota AP mode again.
              if (Wifi.wifi_test_AP_TIMEOUT) {
                Wifi.wifiTest = WIFI_TEST_FINISHED;
                AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_WIFI D_CMND_SSID " %s: " D_ATTEMPTING_CONNECTION), SettingsText(Wifi.wifi_Test_Save_SSID2 ? SET_STASSID2 : SET_STASSID1) );
                if (MAX_WIFI_OPTION != Wifi.old_wificonfig) {
                  TasmotaGlobal.wifi_state_flag = Settings->sta_config = Wifi.old_wificonfig;
                }
                TasmotaGlobal.save_data_counter = Wifi.save_data_counter;
                Settings->save_data = Wifi.save_data_counter;
                SettingsSaveAll();
              }
              Wifi.wifi_test_AP_TIMEOUT = true;
          }
          WiFi.scanNetworks(); // restart scan
        }
      }
      break;
    case FUNC_COMMAND:
      result = DecodeCommand(kWebCommands, WebCommand);
      break;
  }
  return result;
}

// AIS include start
#include "./ais_html/AIS_INDEX.h"
#include "./ais_html/AIS_CONSOLE.h"
#include "./ais_html/AIS_ABOUT.h"
#include "./ais_html/AIS_MQTT.h"
#include "./ais_html/AIS_INFO.h"
#include "./ais_html/AIS_HA.h"
#include "./ais_html/AIS_Z2M.h"
#include "./ais_html/AIS_HEAD.h"
#include "./ais_html/AIS_END.h"
#include "./ais_html/AIS_UPGRADE.h"
#include "./ais_html/AIS_UPGRADE_32.h"

// AIS include end

void AisWebRestart(){

    AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_HTTP D_RESTART));
    Webserver->client().flush();
    Webserver->setContentLength(CONTENT_LENGTH_UNKNOWN);

    WSContentSend_P(AIS_HEAD);
    WSContentSend_P(AIS_INFO, 7000);
    WSContentSend_P(AIS_END);

    Web.chunk_buffer = "";
    Webserver->sendContent("", 0);
    Webserver->client().stop();

    TasmotaGlobal.restart_flag = 2;
}

void ais_main(){
  Webserver->client().flush();
  Webserver->setContentLength(CONTENT_LENGTH_UNKNOWN);

  float c = 32.4; 
  #ifdef ESP32
    c = CpuTemperature();
  #endif  // ESP32

  WSContentSend_P(AIS_HEAD);
  WSContentSend_P(AIS_INDEX, TasmotaGlobal.version, TasmotaGlobal.version);
  WSContentSend_P(AIS_END);

  Web.chunk_buffer = "";
  Webserver->sendContent("", 0);
  Webserver->client().stop();
}


void HandleAisConsole(void) {

  Webserver->client().flush();
  Webserver->setContentLength(CONTENT_LENGTH_UNKNOWN);

  WSContentSend_P(AIS_HEAD);
  WSContentSend_P(AIS_CONSOLE);
  WSContentSend_P(AIS_END);

  Web.chunk_buffer = "";
  Webserver->sendContent("", 0);
  Webserver->client().stop();

