sviete/Tasmota-ESP32/tasmota/tasmota_xdrv_driver/xdrv_01_9_webserver.ino
}

void HandleAisInfo(void) {

  Webserver->client().flush();
  Webserver->setContentLength(CONTENT_LENGTH_UNKNOWN);

  WSContentSend_P(AIS_HEAD);
  WSContentSend_P("<style>.container-fluid {padding: 60px 50px;} .bg-grey {background-color: #f6f6f6;}.logo {font-size: 200px;}");
  WSContentSend_P("@media screen and (max-width: 768px) {.col-sm-4 {text-align: center;margin: 25px 0;}</style>");
  WSContentSend_P(AIS_ABOUT, TasmotaGlobal.version , GetBuildDateAndTime().c_str(), 
                  ESP.getSdkVersion(), ESP_getChipId(), GetDeviceHardwareRevision().c_str());
  WSContentSend_P(AIS_END);

  Web.chunk_buffer = "";
  Webserver->sendContent("", 0);
  Webserver->client().stop();

}

void HandleAisMqtt(void) {

    
  if (Webserver->hasArg(F("save"))) {
    MqttSaveSettings();
    AisWebRestart();
    return;
  }

  Webserver->client().flush();
  Webserver->setContentLength(CONTENT_LENGTH_UNKNOWN);

  WSContentSend_P(AIS_HEAD);
  WSContentSend_P("<script>var x=null,lt,to,tp,pc='';eb=s=>document.getElementById(s);qs=s=>document.querySelector(s);sp=i=>eb(i).type=(eb(i).type==='text'?'password':'text');wl=f=>window.addEventListener('load',f);function jd(){var t=0,i=document.querySelectorAll('input,button,textarea,select');while(i.length>=t){if(i[t]){i[t]['name']=(i[t].hasAttribute('id')&&(!i[t].hasAttribute('name')))?i[t]['id']:i[t]['name'];}t++;}}function sf(s){var t=0,i=document.querySelectorAll('.hf');while(i.length>=t){if(i[t]){i[t].style.display=s?'block':'none';}t++;}}wl(jd);</script>");

  WSContentSend_P(AIS_MQTT,
                SettingsText(SET_MQTT_HOST),
                Settings->mqtt_port,
                (!strlen(SettingsText(SET_MQTT_USER))) ? "0" : SettingsText(SET_MQTT_USER),
                SettingsText(SET_MQTT_CLIENT),
                SettingsText(SET_MQTT_TOPIC), 
                SettingsText(SET_MQTT_FULLTOPIC)
  );

  WSContentSend_P(AIS_END);

  Web.chunk_buffer = "";
  Webserver->sendContent("", 0);
  Webserver->client().stop();
}

void HandleAisHomeAssistant(void) {

  Webserver->client().flush();
  Webserver->setContentLength(CONTENT_LENGTH_UNKNOWN);

  WSContentSend_P(AIS_HEAD);
  WSContentSend_P(AIS_HA, "192.168.0.1");
  WSContentSend_P(AIS_END);

  Web.chunk_buffer = "";
  Webserver->sendContent("", 0);
  Webserver->client().stop();
}

void HandleAisZigbee2Mqtt(void) {

  Webserver->client().flush();
  Webserver->setContentLength(CONTENT_LENGTH_UNKNOWN);

  WSContentSend_P(AIS_HEAD);
  WSContentSend_P(AIS_Z2M, "192.168.0.1");
  WSContentSend_P(AIS_END);

  Web.chunk_buffer = "";
  Webserver->sendContent("", 0);
  Webserver->client().stop();
}

void HandleAisUpgrade(void){
  Webserver->client().flush();
  Webserver->setContentLength(CONTENT_LENGTH_UNKNOWN);

  WSContentSend_P(AIS_HEAD);

#ifdef ESP32
  if (EspSingleOtaPartition() && !EspRunningFactoryPartition()) {
      WSContentSend_P(AIS_UPGRADE_32);
  } else {
     WSContentSend_P(AIS_UPGRADE);
  }
 #else
    WSContentSend_P(AIS_UPGRADE);
 #endif

  WSContentSend_P(AIS_END);

  Web.chunk_buffer = "";
  Webserver->sendContent("", 0);
  Webserver->client().stop();

  Web.upload_file_type = UPL_TASMOTA;
}

#endif  // USE_WEBSERVER
